In [10]:
#Improt the database
import pandas as pd
import sqlite3
df = pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv')
conn = sqlite3.connect('mydb.db')
df.to_sql('Employees', conn, if_exists='replace', index=False)

1470

Q1 Python/ Sqlite

In [ ]:
# count the length by python 
total_employees = len(df)
print(f"Total employees: {total_employees}")

Total employees: 1470

In [12]:
# count the length by SQL
s1= pd.read_sql_query("select count (*) FROM Employees;",conn)
s1

   count (*)
0       1470

In [ ]:
# count the employee by department (Python)
department_counts = df.groupby('Department').size()
print("Employee count by Department:")
print(department_counts)

Employee count by Department:
Department
Human Resources            63
Research & Development    961
Sales                     446
dtype: int64

In [14]:
# count the employee by department (SQL)
s2 = pd.read_sql_query("SELECT Department, COUNT(EmployeeNumber) AS " \
"employee_count FROM Employees GROUP BY Department;",conn)
s2

               Department  employee_count
0         Human Resources              63
1  Research & Development             961
2                   Sales             446

In [ ]:
# Average income (Python) 
avg_income = df.groupby('JobRole')['MonthlyIncome'].mean().reset_index()
print("Average monthly income by job role:")
avg_income['MonthlyIncome'] = avg_income['MonthlyIncome'].astype(int)
print(avg_income)

Average monthly income by job role:
                     JobRole  MonthlyIncome
0  Healthcare Representative           7528
1            Human Resources           4235
2      Laboratory Technician           3237
3                    Manager          17181
4     Manufacturing Director           7295
5          Research Director          16033
6         Research Scientist           3239
7            Sales Executive           6924
8       Sales Representative           2626

In [16]:
# Average income (SQL) 
s3 = pd.read_sql_query("SELECT JobRole, AVG(MonthlyIncome) AS average_monthly_income " \
"FROM employees GROUP BY JobRole;",conn)
s3

                     JobRole  average_monthly_income
0  Healthcare Representative             7528.763359
1            Human Resources             4235.750000
2      Laboratory Technician             3237.169884
3                    Manager            17181.676471
4     Manufacturing Director             7295.137931
5          Research Director            16033.550000
6         Research Scientist             3239.972603
7            Sales Executive             6924.279141
8       Sales Representative             2626.000000